Revit 2027 API
ExportFontKey.OriginalFontName Property
 The original font name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginalFontName { get; set; }
Public Property OriginalFontName As String
	Get
	Set
public:
property String^ OriginalFontName {
	String^ get ();
	void set (String^ value);
}
member OriginalFontName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportFontKey Class
Autodesk.Revit.DB Namespace